Autodesk.Revit.DB.ImageType.IsLoadedFromFile
Checks whether the image is loaded from a file.
Revit may generate some images internally, such as save a view to an image.
Returns:
True if the image is loaded from a file, False otherwise.
Since:
2015

Autodesk.Revit.DB.ImageType.Path
The original image file path used if the image is loaded from a disk file, or empty if the image
is generated by Revit internally, such as save a view to an image.
Remarks:
This path will be used when Reload() is called, and also be checked when ReloadFrom() is called.
Since:
2015